{
    "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat-v0.4",
    "lora_alpha": 48,
    "lora_dropout": 0.05,
    "r": 24,
    "peft_type": "LORA",
    "task_type": "CAUSAL_LM",
    "bias": "none",
    "target_modules": [
        "q_proj",
        "k_proj",
        "v_proj",
        "o_proj"
    ]
}